[
	{
		"Type": "General purpose",
		"Link": "https://docs.microsoft.com/en-us/azure/virtual-machines/sizes-general",
		"Sizes": "B, Dsv3, Dv3, Dasv4, Dav4, DSv2, Dv2, Av2, DC, DCv2, Dpdsv5, Dpldsv5, Dpsv5, Dplsv5, Dv4, Dsv4, Ddv4, Ddsv4, Dv5, Dsv5, Ddv5, Ddsv5, Dasv5, Dadsv5",
		"Description": "Balanced CPU-to-memory ratio. Ideal for testing and development, small to medium databases, and low to medium traffic web servers."
	},
	{
		"Type": "Compute optimized",
		"Link": "https://docs.microsoft.com/en-us/azure/virtual-machines/sizes-compute",
		"Sizes": "F, Fs, Fsv2, FX",
		"Description": "High CPU-to-memory ratio. Good for medium traffic web servers, network appliances, batch processes, and application servers."
	},
	{
		"Type": "Memory optimized",
		"Link": "https://docs.microsoft.com/en-us/azure/virtual-machines/sizes-memory",
		"Sizes": "Esv3, Ev3, Easv4, Eav4, Epdsv5, Epsv5, Ev4, Esv4, Edv4, Edsv4, Ev5, Esv5, Edv5, Edsv5, Easv5, Eadsv5, Mv2, M, DSv2, Dv2",
		"Description": "High memory-to-CPU ratio. Great for relational database servers, medium to large caches, and in-memory analytics."
	},
	{
		"Type": "Storage optimized",
		"Link": "https://docs.microsoft.com/en-us/azure/virtual-machines/sizes-storage",
		"Sizes": "Lsv2, Lsv3, Lasv3",
		"Description": "High disk throughput and IO ideal for Big Data, SQL, NoSQL databases, data warehousing and large transactional databases."
	},
	{
		"Type": "GPU",
		"Link": "https://docs.microsoft.com/en-us/azure/virtual-machines/sizes-gpu",
		"Sizes": "NC, NCv2, NCv3, NCasT4_v3, ND, NDv2, NV, NVv3, NVv4, NDasrA100_v4, NDm_A100_v4",
		"Description": "Specialized virtual machines targeted for heavy graphic rendering and video editing, as well as model training and inferencing (ND) with deep learning. Available with single or multiple GPUs."
	},
	{
		"Type": "High performance compute",
		"Link": "https://docs.microsoft.com/en-us/azure/virtual-machines/sizes-hpc",
		"Sizes": "HB, HBv2, HBv3, HC, H",
		"Description": "Our fastest and most powerful CPU virtual machines with optional high-throughput network interfaces (RDMA)."
	}
]